C({"name": "FuncUnit", "type": "class", "comment": "<p>FuncUnit is a powerful functional testing framework written in JavaScript with a jQuery-like syntax.  It provides an \napproachable way to write maintainable cross browser tests.  It is the first functional testing framework written \nfor JavaScript developers by JavaScript developers.</p>\n\n<p>FuncUnit extends [http://docs.jquery.com/QUnit QUnit]'s API with commands like [FuncUnit.prototype.click click], [FuncUnit.prototype.type type], \nand [FuncUnit.prototype.drag drag].  The same tests can be run in browser or automated via Selenium.</p>\n\n<h2>Example:</h2>\n\n<p>The following tests that an AutoSuggest returns 5 results. <br />\n<a href='funcunit/autosuggest/funcunit.html'>See it in action!</a> (Make sure you turn off your popup blocker!)</p>\n\n<pre><code class='javascript'>module(\"autosuggest\",{\n  setup: function() {\n    S.open('autosuggest.html')\n  }\n});\n\ntest(\"JavaScript results\",function(){\n  S('input').click().type(\"JavaScript\")\n\n  // wait until we have some results\n  S('.autocomplete_item').visible(function(){\n    equal( S('.autocomplete_item').size(), 5, \"there are 5 results\")\n  })\n});</code></pre>\n\n<h2>Using FuncUnit</h2>\n\n<p>FuncUnit works by loading QUnit, FuncUnit, and your tests into a web page.  Your application is opened in a \nseparate browser window.  The FuncUnit page then drives your application via clicks, types, and drags, reporting \npass/fail in the initial FuncUnit test page.</p>\n\n<h3>Loading a Test</h3>\n\n<p>To get started with a basic test, run:</p>\n\n<pre><code class='javascript'>./js jquery/generate/controller Company.Widget</code></pre>\n\n<p>Open company/widget/funcunit.html in a browser.  You should see a passing test.</p>\n\n<p>The first thing any FuncUnit page does is load its dependencies and a test.  A FuncUnit page:</p>\n\n<ol>\n<li>Loads steal.js</li>\n<li>Loads funcunit and qunit via steal.plugins</li>\n<li>Loads one or more test files</li>\n</ol>\n\n<p>For more details on setting up a FuncUnit test, check out the [FuncUnit.setup Getting Set Up] guide. <br />\nFor more details on using FuncUnit without Steal or JavaScriptMVC, check out the [FuncUnit.standalone Using Standalone FuncUnit] guide.</p>\n\n<h3>Writing a Test</h3>\n\n<p>There are four types of commands in any FuncUnit tests:</p>\n\n<ol>\n<li>Actions - simulate a user interaction ([FuncUnit.prototype.click clicks], [FuncUnit.prototype.type types], [FuncUnit.prototype.drag drags], etc)</li>\n<li>Waits - wait for conditions in the page before continuing the test ([FuncUnit.prototype.width width], [FuncUnit.prototype.visible visible], <br />\n[FuncUnit.prototype.text text], etc)</li>\n<li>Getters - get page conditions to use in assertions ([FuncUnit.prototype.width width], [FuncUnit.prototype.hasClass hasClass], [FuncUnit.prototype.text text])</li>\n<li>QUnit commands - assertions and methods for setting up tests (module, test, ok, equals, etc)</li>\n</ol>\n\n<p>Tests follow a consistent pattern:</p>\n\n<ol>\n<li>Each test sets itself up in QUnit's [http://docs.jquery.com/QUnit/module setup] method by opening an application page with S.open.</li>\n<li>Tests simulate a user action, like clicking a link.</li>\n<li>Then they wait for some page condition to change, like a menu appearing.\n3*. Then you assert something about your page, like the right number of links are visible.\nThis step isn't always necessary.  You can write an entire test without assertions.  If the wait condition fails, the test will fail.</li>\n</ol>\n\n<p>For more information on writing tests, check out the [FuncUnit.writing Writing Tests] guide.</p>\n\n<h2>Running a Test</h2>\n\n<p>To run this test in browser, open funcunit.html in any browser (and turn off your popup blocker!).</p>\n\n<p>To run the same test automated via Selenium, run:</p>\n\n<pre><code class='javascript'>./funcunit/envjs path/to/funcunit.html</code></pre>\n\n<p>For more information about using Selenium, checkout the [FuncUnit.selenium Automated FuncUnit] guide.\n Use envjs.bat for Windows users.</p>\n\n<h2>What is FuncUnit</h2>\n\n<p>Under the hood, FuncUnit is built on several projects:</p>\n\n<ul>\n<li>[http://seleniumhq.org/ Selenium] - used to open browsers and run automated tests</li>\n<li>[http://docs.jquery.com/Qunit QUnit] - Unit testing framework provides test running, assertions, and reporting</li>\n<li>[http://jquery.com/ jQuery] - used to look up elements, trigger events, and query for page conditions</li>\n<li>[http://www.envjs.com Env.js] - Rhino based headless browser used to load pages in the command line</li>\n<li>[http://www.mozilla.org/rhino/ Rhino] - command line JavaScript environment running in Java</li>\n<li>[https://github.com/jupiterjs/syn Syn] - event simulation library</li>\n</ul>\n\n<p>FuncUnit is designed to let JavaScript developers write tests in an easy to learn jQuery-like syntax. \nThe tests will run in browser, so developers can check for regressions as they work.  The same tests also run \nvia Selenium, so QA can automate nightly builds or continuous integration.</p>\n\n<h2>Why FuncUnit</h2>\n\n<p>TESTING IS PAINFUL.  Everyone hates testing, and most front end developers simply don't test.  There \nare a few reasons for this:</p>\n\n<ol>\n<li><strong>Barriers to entry</strong> - Difficult setup, installation, high cost, or difficult APIs.  QTP costs $5K per license.</li>\n<li><strong>Completely foreign APIs</strong> - Testing frameworks often use other languages (Ruby, C#, Java) and new APIs.</li>\n<li><strong>Debugging across platforms</strong> - You can't use firebug to debug a test that's driven by PHP.</li>\n<li><strong>Low fidelity event simulation</strong> - Tests are often brittle or low fidelity because frameworks aren't designed to test heavy JavaScript apps, so \nbrowser event simualation accuracy isn't a top priority.</li>\n<li><strong>QA and developers can't communicate</strong> - If only QA has the ability to run tests, sending bug reports is messy and time consuming.</li>\n</ol>\n\n<p>FuncUnit aims to fix these problems:</p>\n\n<ol>\n<li>FuncUnit is free and has no setup or installation (just requires Java and a browser). </li>\n<li>FuncUnit devs know jQuery, and FuncUnit leverages that knowldge with a jQuery-like API.</li>\n<li>You can run tests in browser and set Firebug breakpoints.</li>\n<li>Syn.js is a low level event simuation library that goes to extra trouble to make sure each browser simulates events exactly as intended.</li>\n<li>Since tests are just JS and HTML, they can be checked into a project and any dev can run them easily.  QA just needs to send a URL to a broken \ntest case.</li>\n</ol>\n\n<p>There are many testing frameworks out there, but nothing comes close to being a complete solution for front end testing like FuncUnit does.</p>", "parents": ["index"], "order": 2, "test": "test.html", "download": "http://github.com/downloads/jupiterjs/funcunit/funcunit-beta-5.zip", "construct": "<p>selects something in the other page</p>", "ret": {"type": "funcunit", "description": ""}, "params": {"selector": {"order": 0, "description": "<p>FuncUnit behaves differently depending if\n the selector is a string, a function, or an object.\n <h5>String</h5>\n The selector is treated as a css selector. <br />\n jQuery/Sizzle is used as the selector so any selector it understands\n will work with funcUnit.  FuncUnit does not perform the selection until a\n command is called upon this selector.  This makes aliasing the selectors to\n JavaScript variables a great technique.\n <h5>Function</h5>\n If a function is provided, it will add that function to the action queue to be run\n after previous actions and waits.\n <h5>Object</h5>\n If you want to reference the window or document, pass <code>S.window</code> \n or <code>S.window.document</code> to the selector.  </p>", "name": "selector", "type": "String|Function|Object", "optional": false}, "context": {"order": 1, "description": "<p>If provided, the context is the frame number in the\n document.frames array to use as the context of the selector.  For example, if you\n want to select something in the first iframe of the page:</p>\n\n<pre><code> S(\"a.mylink\",0)\n</code></pre>", "name": "context", "type": "Number", "optional": true}}, "src": "../funcunit/funcunit.js", "children": ["FuncUnit.static", "FuncUnit.prototype", "setup", "writing", "runselenium", "mastering", "standalone", "example"]})