C({"name": "mvc", "type": "page", "comment": "<p>JavaScriptMVC (JMVC) is an open-source jQuery-based JavaScript framework.  It is nearly a comprehensive (holistic) front-end development framework, packaging utilities for testing, dependency management, documentation, and a host of useful jQuery plugins.  </p>\n\n<p>Yet every part of JavaScriptMVC can be used without every other part, making the library lightweight.  Its Class, Model, View, and Controller combined are only 7k minified and compressed, yet even they can be used independently.  JavaScriptMVC's independence lets you start small and scale to meet the challenges of the most complex applications on the web.</p>\n\n<p>This tutorial covers <strong>only</strong> JavaScriptMVC's $.Class, $.Model, $.View, and $.Controller.  The following describes each component:</p>\n\n<ul>\n<li><code>$.Class</code> - JavaScript based class system</li>\n<li><code>$.Model</code> - traditional model layer</li>\n<li><code>$.View</code> - client side template system</li>\n<li><code>$.Controller</code> - jQuery widget factory</li>\n</ul>\n\n<p>JavaScriptMVC's naming conventions deviate slightly from the \ntraditional <a href=\"http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller#Concepts\">Model-View-Controller</a> design pattern. $.Controller is used to create traditional view controls, like pagination buttons and list, as well as traditional controllers, which coordinate between the traditional views and models.</p>\n\n<h2>Setup</h2>\n\n<p>JavaScriptMVC can be used as a single download that includes the entire framework.  But since \nthis chapter covers only the MVC parts, go to \nthe <a href=\"http://javascriptmvc.com/builder.html\">download builder</a>, check Controller, Model, \nand View's EJS templates and click download.  </p>\n\n<p>The download will come with minified and unminified versions of jQuery and the plugins you selected.  Load these with script tags in your page:</p>\n\n<pre><code>&lt;script type='text/javascript' src='jquery-1.6.1.js'&gt;&lt;/script&gt;  \n&lt;script type='text/javascript' src='jquerymx-1.0.custom.js'&gt;&lt;/script&gt; \n</code></pre>", "title": "The MVC in JavaScriptMVC", "parents": ["tutorials"], "order": 2, "src": "tutorials/mvc/mvc.md", "children": ["mvc.model", "mvc.view"]})