c({"name": "Mxui.Layout.Bgiframe", "inherits": "jQuery.Controller", "type": "class", "comment": "<p>The bgiframe is chainable and applies the iframe hack to get \naround zIndex issues in IE6. It will only apply itself in IE6 \nand adds a class to the iframe called 'bgiframe'. The iframe\nis appeneded as the first child of the matched element(s) \nwith a tabIndex and zIndex of -1.</p>\n\n<p>By default the plugin will take borders, sized with pixel units,\ninto account. If a different unit is used for the border's width,\nthen you will need to use the top and left settings as explained below.</p>\n\n<p>NOTICE: This plugin has been reported to cause perfromance problems\nwhen used on elements that change properties (like width, height and\nopacity) a lot in IE6. Most of these problems have been caused by \nthe expressions used to calculate the elements width, height and \nborders. Some have reported it is due to the opacity filter. All \nthese settings can be changed if needed as explained below.</p>\n\n<pre><code>$('div').bgiframe();\n\n&lt;div&gt;&lt;p&gt;Paragraph&lt;/p&gt;&lt;/div&gt;\n\n &lt;div&gt;&lt;iframe class=\"bgiframe\".../&gt;&lt;p&gt;Paragraph&lt;/p&gt;&lt;/div&gt;\n</code></pre>", "parents": ["Mxui"], "params": {"iframe.": {"order": 0, "description": "<ul>\n<li>String|Number top The iframe must be offset to the top\n    by the width of the top border. This should be a negative \n number representing the border-top-width. If a number is \n    is used here, pixels will be assumed. Otherwise, be sure\nto specify a unit. An expression could also be used. \n    By default the value is \"auto\" which will use an expression \n    to get the border-top-width if it is in pixels.</li>\n<li>String|Number left The iframe must be offset to the left\n    by the width of the left border. This should be a negative \n number representing the border-left-width. If a number is \n    is used here, pixels will be assumed. Otherwise, be sure\nto specify a unit. An expression could also be used. \n    By default the value is \"auto\" which will use an expression \n    to get the border-left-width if it is in pixels.</li>\n<li>String|Number width This is the width of the iframe. If\na number is used here, pixels will be assume. Otherwise, be sure\n    to specify a unit. An experssion could also be used.\nBy default the value is \"auto\" which will use an experssion\n    to get the offsetWidth.</li>\n<li>String|Number height This is the height of the iframe. If\na number is used here, pixels will be assume. Otherwise, be sure\n    to specify a unit. An experssion could also be used.\nBy default the value is \"auto\" which will use an experssion\n    to get the offsetHeight.</li>\n<li>Boolean opacity This is a boolean representing whether or not\n    to use opacity. If set to true, the opacity of 0 is applied. If\nset to false, the opacity filter is not applied. Default: true.</li>\n<li>String src This setting is provided so that one could change \nthe src of the iframe to whatever they need.\nDefault: \"javascript:false;\"</li>\n</ul>", "name": "iframe.", "type": "Map settings Optional settings to configure the", "optional": false}}, "author": "Brandon Aaron (brandon.aaron@gmail.com || http://brandonaaron.net)", "src": "mxui/layout/bgiframe/bgiframe.js", "line": 12, "children": []})