C({"name": "playermx", "type": "page", "comment": "<p>This article provides a walkthrough and insight into a simple video player application. Utilizing Popcorn.js and built on JMVC 3.2, we'll cover installing and running the application locally, as well as outlining the templated event engine.  </p>\n\n<p><strong>Topics:</strong> <br />\nDownload/Install <br />\nArchitecture <br />\nRunning the app  </p>\n\n<h2>Download/Install</h2>\n\n<h3>Download via getjs</h3>\n\n<p>From a directory containing steal:</p>\n\n<p>./js steal/getjs https://github.com/jupiterjs/playermx playermx</p>\n\n<h3>Git via Github</h3>\n\n<p>From a directory of your choice:</p>\n\n<p><em>Clone files to your local drive</em> <br />\n<code>$ git clone https://github.com/jupiterjs/playermx.git</code>  </p>\n\n<p><em>Navigate to application directory and initialize submodules</em> <br />\n<code>$ cd playermx <br />\n$ git submodule init <br />\n$ git submodule update</code></p>\n\n<h2>Running</h2>\n\n<p>As we are only dealing with local js/html resources, it is completely possible to run this application from the file system. I recommend <a href=\"http://www.apple.com/safari\">Safari</a> or <a href=\"http://www.mozilla.org/firefox\">Firefox</a> for file system testing as they allow the browser to make XHRs locally. Safari will do this by default, but for Firefox you need to do the following:  </p>\n\n<p>Navigate to about:config <br />\nSet security.fireuri.strict to false  </p>\n\n<p>You should be able to open playermx/player.html in your browser and see the application run.  </p>\n\n<p><em>Note: Running from the file system has pros and cons in local development. Being able to run an application locally allows for convenience and provides an avenues for automated testing. For local debugging, however, sometimes it is easier with the help of a local server. Browsers do not track file system XHRs, so you may have a few silent errors when developing. I use and recommend <a href=\"http://www.mamp.info\">MAMP</a> if you are a Mac developer, but you can use any localhost setup you feel comfortable with.</em></p>\n\n<h2>Architecture</h2>\n\n<p>Once you've downloaded the application, you'll notice 3 folders within your playermx directory. A few notes on the directory structure of this application:</p>\n\n<ul>\n<li>The 'jquery' folder refers to [jquerymx] [2]. This is the JMVC core and what we'll be building our application on.</li>\n<li>The ['steal'] [1] folder is our dependency management system. This is how we include other resources such as scripts, stylesheets, templates or other JMVC resources and apps altogether.</li>\n<li>The 'player' folder is where we'll place our focus as this is the main directory for our application.  </li>\n</ul>\n\n<p>The application is broken up into one main application page, 'player.html', with a corresponding script, 'player.js' and two corresponding widgets. We'll touch player.js first.  </p>\n\n<h3>player.js</h3>\n\n<p>Player.js is our main application script. We'll load any widgets we want to use and initialize them from this file. [Steal] [1] allows each resource to have resources of its own, allowing for a clean separation of the code base.</p>\n\n<pre><code>steal('./play.js',\n  './position.js',\n\n  function() {\n    var video = Popcorn(\"#trailer\");\n\n    $('#play').play({ video: video });\n    $('#position').player_position({ video: video });\n});\n</code></pre>\n\n<p>The first line of player.js is our call to [steal] [1]. This is going to load all our dependencies. In this case, we load play.js and position.js, then execute a function.  </p>\n\n<p><em>Tip: ./play.js is a relative path.</em>  </p>\n\n<p>Our app is loading and playing a video clip, so we're going to utilize Popcorn.js to give us some control over our presentation. Play and Position are widgets we have created to isolate functionality within this app. Let's build these widgets using the video object returned from Popcorn.js.  </p>\n\n<h3>play.js</h3>\n\n<pre><code>steal('player/popcorn',\n  'jquery/controller',\n\n  function() {\n</code></pre>\n\n<p>The purpose of this widget is to control the video playback. Lets setup some event listeners to handle the playing and pausing of our video. Using <a href=\"http://javascriptmvc.com/docs.html#&amp;who=jQuery.Controller\">$.Controller</a>, we can create our widget at the target element outlined above. We'll name our controller 'Play', which will allow this to be accessed via $('selector').play({}). Our init method will check the initial state of our video and set the text accordingly.</p>\n\n<pre><code>    $.Controller('Play', {\n      init : function(){\n        if( this.options.video.video.paused ) {\n          this.element.text(\"play\")\n        } else {\n          this.element.text(\"stop\")\n        }\n      },\n</code></pre>\n\n<p>Now to illustrate JMVC's templated event system, we can setup a few event handlers. Within player.js, we've passed a video object to our controller. We can listen to events directly on the passed object using JMVC's string interpolation syntax. In the below code, \"{video}\" refers to our model and \"play\" is the event we'll listen for.</p>\n\n<pre><code>      \"{video} play\" : function() {\n        this.element.text(\"stop\").addClass('stop')\n      },\n\n      \"{video} pause\" : function() {\n        this.element.text(\"play\").removeClass('stop')\n      },\n</code></pre>\n\n<p>We can also listen to general events within our widget. In this case, we'll listen to any clicks within 'Play' and in turn toggle the play/pause events respectively. The separation of the click handler and the play/pause handlers is for extensibility. We may have multiple widgets that control the playback of our video and each widget should be able to respond accordingly.</p>\n\n<pre><code>      click : function() {\n        if( this.options.video.video.paused ) {\n          this.options.video.play()\n        } else {\n          this.options.video.pause()\n        }\n      }\n  });\n});\n</code></pre>\n\n<h3>position.js</h3>\n\n<pre><code>steal('player/popcorn',\n  'jquery/controller',\n  'jquery/dom/dimensions',\n  'jquery/event/resize',\n  'jquery/event/drag/limit',\n</code></pre>\n\n<p>Similar to the creation of our 'Play' widget, let's make a widget to show a progression bar for our video. We want this to not only display playback position, but be interactive in what the user might expect. We'll utilize a few more of JMVC's built in events to handle this.  </p>\n\n<p>The init method is what we'll use to setup a few basic properties for our widget. 'this' in the following context, refers to our widget instance. We'll add a 'moving' property, which is our progress indicator. A simple div will suffice for this example and we'll set some basic css properties such as position and dimensions.</p>\n\n<pre><code>  function() {\n    $.Controller('PlayerPosition', {\n      init : function(){\n        this.moving = $(\"&lt;div&gt;\").css({\n          position: 'absolute',\n          left: \"0px\"\n        })\n\n        this.element.css(\"position\",\"relative\")\n          .append(this.moving);\n\n        this.moving.outerWidth( this.element.height() );\n        this.moving.outerHeight( this.element.height() );\n\n      },\n</code></pre>\n\n<p>We'll listen to the timeupdate event on our video model to recalculate our indicator position. We've separated the event listener from the resize method to allow for any other widgets that may be listening to timeupdate.</p>\n\n<pre><code>      \"{video} timeupdate\" : function(video){\n        this.resize()\n      },\n      resize : function(){\n        var video = this.options.video,\n          percent = video.currentTime() / video.duration(),\n          width = this.element.width() - this.moving.outerWidth();\n\n        this.moving.css(\"left\", percent*width+\"px\")\n      },\n</code></pre>\n\n<p><em>Note: 'draginit' and 'dragend' are just a couple of events provided by the JMVC framework. Other special events can be found <a href=\"http://javascriptmvc.com/docs.html#&amp;who=jQuery.event.special\">here</a>.</em>  </p>\n\n<p>We won't listen globally for our drag events, but rather scope them to our indicator div element. We can now fire our pause/play events, trusting other widgets to respond as needed. In this app, these events will get picked up by our 'Play' widget to start/stop the playback.</p>\n\n<pre><code>      \"div draginit\" : function(el, ev, drag){\n        this.options.video.pause()\n        drag.limit(this.element)\n      },\n      \"div dragend\" : function(el, ev, drag){\n        var video = this.options.video,\n          width = this.element.width() - this.moving.outerWidth()\n          percent = parseInt(this.moving.css(\"left\"), 10) / width;\n\n        video.currentTime(  percent * video.duration()  );\n        video.play()\n      }\n    });\n});\n</code></pre>\n\n<p>[1] https://github.com/jupiterjs/steal.git\n[2] https://github.com/jupiterjs/jquerymx.git</p>", "title": "PlayerMX", "parents": ["examples"], "order": 1, "src": "tutorials/playermx.md", "children": []})