C({"name": "why", "type": "page", "comment": "<p>So you've read through the list of features and you're still not \nconvinced JavaScriptMVC is right for you.  If you're looking for\na little (<i>extremely biased</i>) advice, you've come to the \nright place.</p>\n\n<h2>Who Should Use JavaScriptMVC?</h2>\n\n<p>JavaScriptMVC is designed to enhance jQuery development\nfor medium to large projects.  You should care about\ncode quality, performance, and maintainability.</p>\n\n<p>If you don't care about these things, or think jQuery is enough \nfor any project,\nyou don't know what you're doing, and you will\nembarrass the project by using it. Leave now.</p>\n\n<p>If you do care, here's how JavaScriptMVC helps you:</p>\n\n<h2 style='color:#96A84A;'>\n    JavaScriptMVC makes everything you should be doing, as easy as possible!\n</h2>\n\n<p>Here's a few things you should be doing:</p>\n\n<ul>\n<li>Testing (especially automatic and functional testing)</li>\n<li>Documenting</li>\n<li>Breaking up code into logically organized files</li>\n<li>Compressing and concatenating your JavaScript files</li>\n<li>Using and organizing client side templates</li>\n<li>Making plugins that clean themselves up, are internally organized, and extendable.</li>\n<li>Error reporting</li>\n</ul>\n\n<p>All of these things are hard or impossible to do right with jQuery alone.  </p>\n\n<p>You can add your own automated testing library - \nQUnit isn't automated, it's difficult to write Selenium tests.</p>\n\n<p>You can add your own documentation engine - JSDoc, make sure you keep track of every file!</p>\n\n<p>You can add your own way of loading and compressing scripts - RequireJS.</p>\n\n<p>You can use other client side template libraries - jquery-tmpl, but you won't be able to compress them into your build or put them in external files as easily.</p>\n\n<p>You can be careful to structure your jQuery plugins so they can be easily removed from an element, remove all event handlers, and provide some mechanism for extending or overwriting your plugin.</p>\n\n<p>You can devise your own way of doing error reporting.</p>\n\n<h3>OR ...</h3>\n\n<p>You can download JavaScriptMVC and run:</p>\n\n<pre><code class='text'>js steal/generate/app APPNAME</code></pre>\n\n<p>and get all of these things for free.</p>\n\n<p>JavaScriptMVC's greatest strength is it's integration. \nEverything you should be doing is available immediately.</p>\n\n<h2>Ease of Adoption</h2>\n\n<p>Despite the huge amount of features, JavaScriptMVC is\neasy to learn.  </p>\n\n<p>Every component includes:</p>\n\n<ul>\n<li>thorough documentation</li>\n<li>demo examples</li>\n<li>test pages</li>\n<li>a write-up on <a href='http://jupiterjs.com/pages/javascriptmvc'>JavaScriptMVC's blog</a>.</li>\n</ul>\n\n<p>We are extremely active on the <a href='http://forum.javascriptmvc.com/'>forums</a>, with essentially\nzero unanswered questions.</p>\n\n<p>We've released a number of mini apps that are built the \nJavaScriptMVC way.</p>\n\n<p><a href='http://jupiterjs.com'>Jupiter Consulting</a> provides JavaScriptMVC training, support,\nand consulting services.</p>", "title": "0. Why JavaScriptMVC", "src": "../jmvc/pages/why.js", "children": []})