c({"name": "funcunit.integrations", "children": ["funcunit.envjs", "funcunit.grunt", "funcunit.jenkins", "funcunit.maven", "funcunit.phantomjs", "funcunit.selenium"], "type": "page", "comment": "<p>FuncUnit integrates with third party browser automation and build tools.</p>\n\n<h2>Browser automation</h2>\n\n<p>To integrate FuncUnit tests with QA automation, FuncUnit tests can be launched by several methods.</p>\n\n<p>[funcunit.selenium Selenium] launches visual browsers. It runs selenium tests and reports results to the \ncommandline.</p>\n\n<pre><code>./js funcunit/open/selenium path/to/funcunit.html\n</code></pre>\n\n<p>[funcunit.envjs Envjs] is a simulated browser environment that runs in Rhino. It does not support visual \nsimulation, like clicking or dragging, but can be used for basic unit testing.</p>\n\n<pre><code>./js funcunit/open/envjs path/to/qunit.html\n</code></pre>\n\n<p>[funcunit.phantomjs PhantomJS] is a headless version of WebKit. It supports runnning full FuncUnit tests \nwithout actually launching a browser. It is faster than using Selenium to launch browsers.</p>\n\n<pre><code>./js funcunit/open/phantomjs path/to/funcunit.html\n</code></pre>\n\n<h2>Build tools</h2>\n\n<p>Using browser automation tools, FuncUnit can be integrated into the project build.</p>\n\n<p>[funcunit.grunt Grunt] is a task-based command line build tool for JavaScript projects. FuncUnit tests can be run \nas a grunt build step. When tests fail, the build also fails.</p>\n\n<p>[funcunit.maven Maven] is a build tool used with Java projects. FuncUnit tests can be run \nas a maven build step. When tests fail, the build also fails.</p>\n\n<p>[funcunit.jenkins Jenkins] is a continuous integration tool, used to continuously run builds, tests, and \nreport on the health of the codebase. FuncUnit can be tied into Jenkins and made to fail the Jenkins build \nif FuncUnit tests aren't passing, which would alert developers of problems immediately. </p>\n\n<p>[http://xunit.codeplex.com XUnit] is a unit testing framework for .NET, whose reporting format is now used in tools across different platforms.  XUnit defines a [http://xunit.codeplex.com/wikipage?title=XmlFormat standard XML test output file format]. </p>\n\n<p>To turn on the FuncUnit XUnit reporter, supply a -out parameter on the commandline like:</p>\n\n<pre><code>./js funcunit/open/phantomjs path/to/funcunit.html -out \"output.xml\"\n</code></pre>\n\n<p>Tools like Jenkins can read this format.  If you turn on the XUnit reporter, every time FuncUnit runs a test \nfile called <code>testresults.xml</code> is written to the main directory of your project. </p>\n\n<p>Results are also printed to the console in an easy to read format.</p>\n\n<pre><code>MABOSBMOSCHE-M1:jmvc31 bmoschel$ ./js \n  funcunit/run phantomjs cookbook/funcunit.html \nUsing Default Settings\nstarting steal.browser.phantomjs\n\nrecipe\n  recipes present\n    [x] There is at least one recipe\n  create recipes\n    [x] Typed Ice\n  edit recipes\n    [x] Typed Cold Tap Water\n  destroy\n    [x] Typed Ice Water\n    [x] \n\nTime: 11 seconds, Memory: 81.06 MB\n\nOK (4 tests, 5 assertions)\n</code></pre>", "title": "Integrations", "parents": ["FuncUnit"], "order": 5, "src": "funcunit/pages/integrations.md"})